# Getting Started with pandas

1. Review를 위한 단계
- 방식 : chapter05 장을 보면서 이해하고 주석 달기
- 제출 방식 : 강사가 제시한 폴더에 파일명 수정해서 제출하기
- 파일명 : **step03_bookReview임동원.ipynb**

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame # Series는 벡터 DataFrame 은 매트릭스

## Introduction to pandas Data Structures

### Series

In [2]:
obj = pd.Series([4, 7, -5, 3]) #쉽게 python의 dictionary 를 정열 했다고 생각 하면 된다
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
obj.index # Series의 index 명칭을 확인 할 수 있다 그리고 숫자일 경우에는 전체 길이를 확인 할 수있다

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c']) # 인덱스 명칭은 수정이 가능하다
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2.index # 수정한 index 확인

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
obj2['a'] #'a' 인덱스에 해당하는 값 출력

-5

In [9]:
obj2['d'] = 6 # 'a' 인덱스에 해당하는 위치에 값을 변경한다

In [10]:
obj2[['c', 'a', 'd']] # 여러개의 인덱스를 동시에 출력이 가능하다

c    3
a   -5
d    6
dtype: int64

In [11]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [18]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [13]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [21]:
np.exp(obj2) # 자연상수인 오일러의 e의 지수를 계산한다

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [22]:
'b' in obj2 # 인덱스가 해당 Series에 있는지 확인하는 방법

True

In [16]:
'e' in obj2

False

In [23]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata) # 디셕너리를 시리즈에 넣을 수 있다
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [24]:
states = ['California', 'Ohio', 'Oregon', 'Texas'] # 기존의 있던 벡터에서 인덱스만 일치하더라도 동일한 형태의 Series가 생성이 가능하다 
obj4 = pd.Series(sdata, index=states) # 일부분 없는 인덱스를 입력하면 null 값으로 처리한다 
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [25]:
pd.isnull(obj4) # 각 행이 null 값인지 확인하는 방법

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [26]:
pd.notnull(obj4) #각 행이 null 값아 아닌지 확인하는 방법

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [27]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [28]:
obj3
obj4
obj3 + obj4 # 값이 int이면 기본 계산이 가능하다

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [29]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [33]:
obj4.name = 'population' #값에 이름을 부여하거나 수정이 가능하다
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [34]:
obj4.index.name = 'state' # 인덱스에 이름을 부여할 수 있다 
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [35]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [36]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

In [37]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], # Frame 은 표같은 스프레드시트 형식의 자료 구조로 여러 개의 칼럼이 있다
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [38]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [39]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [40]:
frame.head() # 데이터가 너무 많을 경우 앞부분만 보게 할 수 있다

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [41]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [42]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four','five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [43]:
frame2.columns # 컬럼만 출력

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [44]:
frame2['state'] #해당 컬럼에 해당하는 값을 출력 가능 serise의 인덱스랑 헷갈리기 쉬움

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [45]:
frame2.year # 컬럼을 뽑아내는 다른 방식

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [46]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [47]:
frame2.loc['three'] #로우에 해당하는 값을 출력하고 싶으면 loc라는 함수를 붙어야 한다 단 해당 로우에 해당하는 인덱스 이름을 입력만 가능하다

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [48]:
frame2['debt'] = 16.5 #여기서 조심해야 할것은 컬럼내에 있는 모든 값을 바꿀 수도 있으니 신중하게 사용해야 한다
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [50]:
frame2['debt'] = np.arange(6.) # 컬럼안에 열이 많이 있으니 그거에 맟춰서 값을 여러개 넣을 수 있다 
frame2  #여기서는 numpy를 이용한 방식

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [51]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five']) #여기서는 Series 단 index 이름을 확인해야 한다
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [52]:
frame2['eastern'] = frame2.state == 'Ohio' #여기서는 boolean 방식을 이용해서 true or false 를 뽑을 수있는데 동시에 새로운 컬럼도 생산이 가능 
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [53]:
del frame2['eastern'] # del 은 컬럼을 지울 수 있다
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [54]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [55]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [56]:
frame3 = pd.DataFrame(pop) # 2중 딕셔너리를 pandas로 바꾸는 방법
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [57]:
frame3.T # transpose 한것

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [58]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [59]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [60]:
pd.DataFrame(pop)#, index=[2000, 2001, 2002])

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [61]:
pd

In [62]:
!pip show pandas #pandas 설정을 볼 수 있음

Name: pandas
Version: 0.23.0
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: http://pandas.pydata.org
Author: None
Author-email: None
License: BSD
Location: c:\users\playdata\appdata\local\continuum\anaconda3\lib\site-packages
Requires: python-dateutil, numpy, pytz
Required-by: seaborn, odo

In [63]:
# p167 교재와 다름, 
pd.DataFrame(pop, index=pd.Int64Index([2001, 2000, 2002])) # 인덱스 순서 또한 바꿀수 있다

      Nevada  Ohio
2001     2.4   1.7
2000     NaN   1.5
2002     2.9   3.6

In [64]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [65]:
frame3['Ohio'][:-1] # 컬럼중 끝에서 두번쨰 까지 보여줌

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [66]:
frame3['Ohio']

2000    1.5
2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [67]:
pdata = {'Ohio': frame3['Ohio'][:-1], #여기서 주의 해야 할건 전체 열 수를 알아야 한다
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [68]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [69]:
frame3.index.name = 'year' # 인덱스 전체 명칭을 만들 수 있다
frame3.columns.name = 'state' # 컬럼 전체 이름을 만들 수 있다
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [70]:
frame3.values # 인덱스와 컬럼을 제외한 데이터값만 호출

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [71]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

### Index Objects

In [72]:
obj = pd.Series(range(3), index=['a', 'b', 'c']) # 각 index 이름 설정
obj

a    0
b    1
c    2
dtype: int64

In [73]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [74]:
index[1:]

Index(['b', 'c'], dtype='object')

In [76]:
index[1] = 'd'  # TypeError

TypeError: Index does not support mutable operations

In [75]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [77]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [78]:
obj2.index

Int64Index([0, 1, 2], dtype='int64')

In [80]:
print(type(obj2.index))

<class 'pandas.core.indexes.numeric.Int64Index'>

In [79]:
obj2.index is labels

True

In [81]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [82]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [83]:
'Ohio' in frame3.columns  # 해당 컬럼명이 컬럼에 있는지 확인

True

In [84]:
2003 in frame3.index # 해당 index명이 컬럼에 있는지 확인

False

In [85]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

## Essential Functionality

### Reindexing

In [86]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [87]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e']) # index 명을 다시 수정
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [88]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [89]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [90]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])

In [91]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [92]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [94]:
states = ['Texas', 'Utah', 'California'] # 컬럼명 설정할때 간단하게 리스트로 미리 만들어 놓고 삽입하는 방법
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### Dropping Entries from an Axis

In [95]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [96]:
new_obj = obj.drop('c') # 특정 row 를 제거하는 명령어
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [97]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [98]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [99]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [100]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [106]:
data.drop('two', axis = 1) # 특정 컬럼을 없앨려고 할때는 반드시 컬럼명과 axis =1 을 입력해야 한다 혹여나 axis = 0하거나 없으면 error가 발생한다

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [102]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [107]:
data.drop(['two', 'four'], axis='columns') # 1 대신 columns를 입력해도 된다

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [108]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [109]:
obj.drop('c', inplace=True) # inplace는 수정하는 frame에 저장할건지 여부이다
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

### Indexing, Selection, and Filtering

In [110]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [111]:
obj['b']

1.0

In [112]:
obj[1]

1.0

In [113]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [114]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [115]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [116]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [117]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [118]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [119]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [120]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), # 4 x 4 
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [121]:
data['two'] # 여기서 헷갈리지 말아야 할게 Series 는 행에서 뽑지만 Frame은 열에서 뽑는다

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [124]:
data[['three', 'one']] # 리스트도 가능

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [125]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [126]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [127]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [128]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [129]:
data[data < 5] = 0

In [130]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Selection with loc and iloc

In [131]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [132]:
data.loc['Colorado', ['two', 'three']] # frame 에서 특정 row를 뽑을려면 loc를 이용하면 가능하다

two      5
three    6
Name: Colorado, dtype: int32

In [133]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [134]:
data.iloc[2] #frame 에서 특정 row를 인덱스 위치로 뽑을려면 iloc를 이용하면 가능하다

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [135]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [136]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [137]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [138]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [139]:
data.iloc[:, :3][data.three > 5] # 해당 컬럼 조건내에 부합하는 값을 가진 행을 통째로 뽑는다

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Integer Indexes

ser = pd.Series(np.arange(3.))
ser
ser[-1]

In [140]:
ser = pd.Series(np.arange(3.)) # 반복문을 이용해서 삽입을 가능하다

In [141]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [144]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [145]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [146]:
ser2[-1]

2.0

In [147]:
ser[:1]

0    0.0
dtype: float64

In [148]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [149]:
ser.iloc[:1]

0    0.0
dtype: float64

### Arithmetic and Data Alignment

In [150]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [151]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [152]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [153]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [154]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'), 
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [155]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [156]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [157]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [158]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})

In [159]:
df1

   A
0  1
1  2

In [160]:
df2

   B
0  3
1  4

In [161]:
df1-df2 # frame내 같은 index 위치에 있는 값들은 수학 계산이 가능하다

    A   B
0 NaN NaN
1 NaN NaN

#### Arithmetic methods with fill values

In [163]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))

In [164]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [165]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [166]:
df2.loc[1, 'b'] = np.nan # null 값을 특정 컬럼의 특정 위치에 추가한다

In [167]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [168]:
df1 + df2 # 크기가 다를경우에는 nan 값으로 열과 행을 추가한다

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [169]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [170]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [171]:
df1.add(df2, fill_value=0) # add는 큰사이즈에 맞게 겹친다 겹치지 않는 부분은 큰 Frame 에 들어있는 값으로 채우고 겹칠 경우에는 산수적으로 더한다

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [172]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [173]:
1 / df1

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [174]:
df1.rdiv(1)

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [175]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series

In [176]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [177]:
arr[0]

array([0., 1., 2., 3.])

In [178]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [179]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [180]:
series = frame.iloc[0] # series 형태로 따로 뽑아낸다

In [181]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [182]:
frame - series # 이계산은 brodcasting 처럼 증폭 식켜서 계산을 한다 그래서 각 로우마다 계산을 해서 값을 도출한다

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [183]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [184]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [185]:
series2

b    0
e    1
f    2
dtype: int64

In [186]:
frame + series2 # 인덱스가 공통된 부분만 계산하고 겹치지 않을 경우에는 nan 값으로 설치한다

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [188]:
series3 = frame['d']

In [189]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [190]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [196]:
frame.sub(series3, axis='index') # 빼기 함수로 row 형태로 맞춰야한다

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [194]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function Application and Mapping

In [197]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -0.520050  2.120860 -1.216044
Ohio    0.093903 -1.607722 -0.656143
Texas   0.379548  0.559723  0.335885
Oregon -0.604623 -0.284350 -2.228325

In [198]:
np.abs(frame) # 절대값으로 바꾼다

               b         d         e
Utah    0.520050  2.120860  1.216044
Ohio    0.093903  1.607722  0.656143
Texas   0.379548  0.559723  0.335885
Oregon  0.604623  0.284350  2.228325

In [199]:
f = lambda x: x.max() - x.min() #최대값에서 최소값을 빼는 람다 함수를 만들고 pandas에 있는 apply 라는 함수로 실행한다
frame.apply(f) # default 는 로우별로 계산

b    0.984171
d    3.728582
e    2.564211
dtype: float64

In [205]:
frame.apply(f, axis='columns') # axis = 'columns'

Utah      3.336904
Ohio      1.701625
Texas     0.223838
Oregon    1.943976
dtype: float64

In [206]:
frame.apply(f, axis=1)

Utah      3.336904
Ohio      1.701625
Texas     0.223838
Oregon    1.943976
dtype: float64

In [207]:
frame

               b         d         e
Utah   -0.520050  2.120860 -1.216044
Ohio    0.093903 -1.607722 -0.656143
Texas   0.379548  0.559723  0.335885
Oregon -0.604623 -0.284350 -2.228325

In [208]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -0.604623 -1.607722 -2.228325
max  0.379548  2.120860  0.335885

In [212]:
format1 = lambda x: '%.2f' % x # %.2f란 소수점 2자리 까지 가지고 있는 형태
frame.applymap(format1) # map 형태로 만들 수 있는 applymap을 이용한다

            b      d      e
Utah    -0.52   2.12  -1.22
Ohio     0.09  -1.61  -0.66
Texas    0.38   0.56   0.34
Oregon  -0.60  -0.28  -2.23

In [213]:
frame['e'].map(format)

Utah      -1.22
Ohio      -0.66
Texas      0.34
Oregon    -2.23
Name: e, dtype: object

### Sorting and Ranking

In [214]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [215]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [216]:
obj.sort_index() # index에 맞춰서 정렬

a    1
b    2
c    3
d    0
dtype: int64

In [217]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])

In [218]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [219]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [220]:
frame.sort_index(axis=1) # 컬럼에 맞춰서 정렬

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [221]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [222]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [223]:
obj = pd.Series([4, 7, -3, 2])

In [224]:
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [225]:
obj.sort_values() # value값대로 정렬

2   -3
3    2
0    4
1    7
dtype: int64

In [226]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [227]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [228]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [229]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [230]:
frame.sort_values(by='b') #컬럼 b의 값들을 우선으로 정렬

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [231]:
frame.sort_values(by=['a', 'b'])#컬럼 a의 값들을 우선으로 정렬한 뒤 b를 2순위로 정렬

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [234]:
obj = pd.Series([7, -5, 7,7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    7
4    4
5    2
6    0
7    4
dtype: int64

In [235]:
obj.rank() # value 값의 랭킹을 매김

0    7.0
1    1.0
2    7.0
3    7.0
4    4.5
5    3.0
6    2.0
7    4.5
dtype: float64

In [236]:
obj.rank(method='first') #공동일지라도 먼저오면 우선순위를 줌

0    6.0
1    1.0
2    7.0
3    8.0
4    4.0
5    3.0
6    2.0
7    5.0
dtype: float64

In [237]:
obj.rank(ascending=False, method='max') # 반대로 랭킹을 정한다

0    3.0
1    8.0
2    3.0
3    3.0
4    5.0
5    6.0
6    7.0
7    5.0
dtype: float64

In [238]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [239]:
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [240]:
frame.rank('columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Axis Indexes with Duplicate Labels

In [241]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
#obj = pd.Series(range(3), index=['a', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [242]:
obj.index.is_unique # 중복값 유무

False

In [243]:
obj['a']

a    0
a    1
dtype: int64

In [244]:
obj['c']

4

In [245]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -0.946825 -0.685589 -0.023648
a  0.709870  0.476603  1.251102
b  0.489433 -0.414048  0.443829
b -0.353495  0.158431  0.282269

In [246]:
df.loc['b']

          0         1         2
b  0.489433 -0.414048  0.443829
b -0.353495  0.158431  0.282269

## Summarizing and Computing Descriptive Statistics

In [247]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [248]:
df.sum() # 합 구함

one    9.25
two   -5.80
dtype: float64

In [249]:
df.sum(axis='columns') # 컬럼 단위로 구함

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [250]:
df.mean(axis='columns', skipna=False) # 컬럼 기준으로 합을 구하는데 nan 값을 포함함

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [251]:
df.mean(axis='columns', skipna=True) # nan을 생략

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [253]:
df.idxmax() # 최대값이 포함된 컬럼을 출력

one    b
two    d
dtype: object

In [254]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [255]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [256]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [257]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [258]:
obj.describe() # frame의 각 컬럼들이 가지고 있는 속성을 보여줌

count     16
unique     3
top        a
freq       8
dtype: object

### Unique Values, Value Counts, and Membership

In [ ]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

In [ ]:
uniques = obj.unique()
uniques

In [ ]:
obj.value_counts()

In [ ]:
obj

In [ ]:
obj

In [ ]:
mask = obj.isin(['b', 'c'])
mask

In [ ]:
obj[mask]

In [ ]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [ ]:
to_match

In [ ]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [ ]:
unique_vals

In [ ]:
pd.Index(unique_vals).get_indexer(to_match)

In [ ]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

In [ ]:
result = data.apply(pd.value_counts).fillna(0)
result

## 누락된 데이터 처리하기

1. 누락된 데이터를 처리하는 일은 데이터 분석 애플리케이션에서 빈번한 작업
- 모든 기술 통계는 누락된 데이터를 배제하고 처리
- 처리 방법 1 : 수집된 데이터를 직접 제거
- 처리 방법 2 : dropna 함수 사용하여 처리

In [ ]:
from numpy import nan as NA

Series의 NA값 제거해 보기

In [ ]:
data = Series([1, NA, 3.5, NA, 7])

In [ ]:
data

In [ ]:
data.dropna()

In [ ]:
data

In [ ]:
data[data.notnull()]

DataFrame의 NA값 제거하기

In [ ]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

In [ ]:
cleaned = data.dropna()
cleaned

In [ ]:
data

In [ ]:
data.dropna(how='all')

In [ ]:
data

In [ ]:
data[4] = NA
data

In [ ]:
df = DataFrame(np.random.randn(7, 3))

In [ ]:
df

In [ ]:
df.loc[:4, 1] = NA

In [ ]:
df

In [ ]:
df.loc[:2, 2] = NA
df

In [ ]:
df.dropna(thresh=3)

In [ ]:
df

In [ ]:
df.dropna(thresh=2, axis=0)

In [ ]:
df

In [ ]:
df.dropna(thresh=5, axis=1)

In [ ]:
df.dropna(thresh=3, axis=1)

누락된 값 채우기

In [ ]:
df

In [ ]:
df.fillna(0)

In [ ]:
df

In [ ]:
df.fillna({1:0.5, 3:-1})

In [ ]:
df

In [ ]:
df.fillna({2:10})

In [ ]:
df

## 계층적 색인

1. pandas의 중요한 기능
- 축에 대해 다중(2개 이상) 색인 단계 지정 가능(MultiIndex)
- 고차원 데이터를 낮은 차원의 형식으로 다룰수 있게 해주는 기능

In [ ]:
data = Series(np.random.randn(10), 
              index=[
                      ['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'], 
                      [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]
              ])

In [ ]:
data

In [ ]:
data.index

In [ ]:
data.values

계층적으로 색인된 객체는 데이터의 부분 집합을 부분적 색인으로 접근이 가능

In [ ]:
data['b']

In [ ]:
data['b':'c']

In [ ]:
data.loc[['b', 'c']]

In [ ]:
data

하위 계층의 객체 선택

In [ ]:
data[:, 2]

계층적인 색인은 데이터를 재형성 가능

In [ ]:
data.unstack()

In [ ]:
data

In [ ]:
data.unstack().stack()

In [ ]:
frame = DataFrame(np.arange(12).reshape(4,3), 
                  index=[['a','a','b','b'], [1, 2, 1, 2]], 
                  columns=[['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])

In [ ]:
frame

In [ ]:
frame.index

In [ ]:
frame.index.names

In [ ]:
frame.index.names = ['key1', 'key2']

In [ ]:
frame.index.name

In [ ]:
frame.index

In [ ]:
frame.columns

In [ ]:
frame.columns.names = ['state', 'color']

In [ ]:
frame

In [ ]:
frame['Ohio']

계층 순서 바꾸고 정렬하기

In [ ]:
frame

In [ ]:
frame.swaplevel('key1', 'key2')

In [ ]:
frame

In [ ]:
frame.sort_index(1)

단계별 요약통계
> level 옵션 : 한축에 대해 합을 구하고 싶은 단계 지정할 수 있는 옵션

In [ ]:
frame

In [ ]:
frame.sum()

In [ ]:
frame.sum(level='key2')

DataFrame의 컬럼 사용하기

In [ ]:
frame = DataFrame({'a':range(7), 'b':range(7, 0, -1), 
                   'c':['one', 'one', 'one', 'two', 'two', 'two', 'two'], 
                   'd' : [0, 1, 2, 0, 1, 2, 3]})

In [ ]:
frame

In [ ]:
# 하나 이상의 칼럼을 색인으로 하는 새로운 DataFrame 생성
frame2 = frame.set_index(['c', 'd'])
frame2

In [ ]:
frame

In [ ]:
# 명시적으로 컬럼 남겨두기
frame.set_index(['c', 'd'], drop=False)

In [ ]:
frame2

In [ ]:
#계층적 색인 단계를 칼럼으로 이동
frame2.reset_index()